login = "greetings18"
password = "Adgk135!lk"
age = 23
email = "catmy@mail.ru"

is_valid = True #флаг для отслеживания, есть ли ошибки

if not (login != "" and len(password) > 5):
    print("Ошибка: Логин не может быть пустым, пароль должен содержать более 5 символов")
    is_valid = False

if age < 18:
    print("Ошибка: Возраст должен быть 18 лет или старше")
    is_valid = False

if not ("@" in email and "." in email.split("@")[-1]):
    print("Ошибка: введите корректный email (пример: user@mail.ru)")
    is_valid = False

if is_valid:
    print("Все данные введены верно. Регистрация успешна")
else:
    print("Испрвьте ошибки и попробуйте снова")

# Короткое замыкание сработало в проверке логина и пароля. если логин пустой, то выражение дает False
# Оператор and видит, что слева уже False и не проверяет правую часть, так как логин уже не валиден

# также короткое замыкание сработало в проверке email.  если email не содержит @, то проверять правую часть
# (наличие точки) уже бессмысленно
