check_1 = print(bool(0))
check_2 = print(bool(0.0))
check_3 = print(bool(""))
check_4 = print(bool("0"))
check_5 = print(bool([]))
check_6 = print(bool([1]))
check_7 = print(bool(None))
check_8 = print(bool({}))
check_9 = print(bool(False))

# Ложными (False) читаются пустые коллекции(списки, словари, строки), число 0 (в любом виде: 0, 0.0) и None.
# Все остальное истинно (True)
# bool("0") — True, потому что "0" - это строка, в ней находится один символ.Строка не пустая
# а bool(0) — False, потому что это число. (пояснение см выше)


# Если пользователь вводит комментарий к посту, и мы проверяем if text:,
# то пустая строка "" даст False (комментарий не отправлен).
# Но если пользователь ввел пробел " ", bool(" ") будет True,
# и программа отправит пустой комментарий.
# Если же нам нужно отличить «пользователь ничего не прислал» (None)
# от «пользователь прислал пустую строку» (""),
# мы обязаны использовать if text is not None:.

